app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
      <tbody>
        <% books = Book.where(user_id: @user.id) %>