app/views/books/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <tbody>
    <% user = User.find(@book.user_id) %>