app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "kotoge"], ["body", "what a day"], ["created_at", "2021-11-22 14:02:18.911002"], ["updated_at", "2021-11-22 14:02:18.911002"], ["user_id", 1]]
---
  def create
    @book = Book.new(books_params)
    @book.user_id = current_user.id
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    if Book.find(params[:id]).user_id == current_user.id
      @book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "kot"], ["updated_at", "2021-11-23 07:59:54.801495"], ["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(books_params)
      flash[:notice] = "Book was successfully updated!"
      redirect_to(book_path(@book.id))
    else
      err_msg = "error! Failed to update data.\n"
      @book.errors.full_messages.each do |msg|