app/controllers/users_controller.rb

  def edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(current_user.id)
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "3cb103ae1a1f46eb4a478997787f58b65aa1ba39feeb7105441e6ae143bf"], ["introduction", "今までで一番楽しかった"], ["updated_at", "2021-11-22 14:59:17.632168"], ["id", 2]]